samples/SOAP XML/IOS+/OrderPadGetByAccountUpdates_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <OrderPadGetByAccountUpdates xmlns="http://webservices.iress.com.au/v4/">
      <Input xmlns="http://webservices.iress.com.au/v4/">
        <Header>
          <ServiceSessionKey>9B2EC77C-E74B-4D20-97F2-F326EF2FDAAC@IDS-TEST</ServiceSessionKey>
          <RequestID>e93c0974-28c9-46e2-8a38-b58743be2f91</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <AccountCodeArray>
            <AccountCode>A001</AccountCode>
          </AccountCodeArray>
          <BackOfficeStatusArray xsi:nil="true" />
          <DestinationArray xsi:nil="true" />
          <DestinationExclude>false</DestinationExclude>
        </Parameters>
      </Input>
    </OrderPadGetByAccountUpdates>
  </soap:Body>
</soap:Envelope>